wisteria-1c/Конфигурация/Catalogs/НастройкиНумерацииДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиНумерацииДоговоровКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримерНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/НастройкиНумерацииДоговоровКонтрагентов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиБаннеры();
	
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация",
			Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.Организация));
	КонецЕсли;
	
	Параметры.Свойство("Договор", Договор);
	Параметры.Свойство("ВидДоговора", ВидДоговора);
	
	УстановитьОтборПоВидуИДоговору();
	УстановитьУсловноеОформлениеПоТекущейНастройке();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиБаннеры()
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Жирным шрифтом выделена текущая настройка по автонумерации'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Выделение строк списка'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.Баннер);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВидуИДоговору()
	
	ГруппаВидИлиДоговор= ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы, "ГруппаВидИлиДоговор");
	
	Если ГруппаВидИлиДоговор = Неопределено Тогда
		ГруппаВидИлиДоговор = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
			"ГруппаВидИлиДоговор",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
	КонецЕсли;
	СписокВидовДоговоров = Новый СписокЗначений;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.ПустаяСсылка());
	СписокВидовДоговоров.Добавить(ВидДоговора);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаВидИлиДоговор,
		"ВидДоговора",
		ВидСравненияКомпоновкиДанных.ВСписке,
		СписокВидовДоговоров,
		,
		ЗначениеЗаполнено(ВидДоговора),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	
	СписокДоговоры = Новый СписокЗначений;
	СписокДоговоры.Добавить(Договор);
	СписокДоговоры.Добавить(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаВидИлиДоговор,
		"Договор",
		ВидСравненияКомпоновкиДанных.ВСписке,
		СписокДоговоры,
		,
		ЗначениеЗаполнено(Договор),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоТекущейНастройке()
	
	Если Параметры.Свойство("ТекущаяАвтонумерация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяНастройка", Параметры.ТекущаяАвтонумерация);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяНастройка", Справочники.НастройкиНумерацииДоговоровКонтрагентов.ПустаяСсылка());
		Элементы.Баннер.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	НовоеУсловноеОформление = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Шрифт");
	Оформление.Значение 		= Новый Шрифт(,, Истина);
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТекущаяНастройка");
	Отбор.ПравоеЗначение 	= Истина;
	
КонецПроцедуры

#КонецОбласти
